//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
int a1= 2;
int b1 = 4;
int c1 = 6;
int a2 = 5;
int b2 =6;
int c2 = 8;
Console.WriteLine(Math.Sqrt(( a2-a1)*(a2-a1)+(b2 - b1)*(b2 - b1)+(c2-c1)*(c2-c1)));
// Math.Sqrt - оператор для корня из числа 